# Assignment 2
## Mike Johnson
### January 27, 2025

****

#### 1. The incoming data will be loaded in everyday at 8:00 PM EST. What kind of data processing is this considered?

This kind data processing is referred to as **batch processing**.

****

#### 2. The data will be in tabular format with rows and columns. What kind of database should the company use to store the data? What are some common database systems that could be used to store the data? What programming language will be used to interact with the data and database?

**What kind of database should the company use to store the data?**<br>
The company should use a **relational database** because they are ideal for structured data.

**What are some common database systems that could be used to store the data?**<br>
* SQL Server
* PostgreSQL
* MySQL
* SQLite

**What programming language will be used to interact with the data and database?** <br>
The programming language to interact with the data and database is **Structured Query Language (SQL)**.

****

#### 3. Currently, the incoming data only consists of tabular, related data. However, in the future, the management team is considering collecting data in JSON format. What kind of database should be used to store this type of data? What are the benefits of storing data in this way? What are the drawbacks?

**What kind of database should be used to store this type of data?** <br>
A **Non-relational (NoSQL, not only SQL)** should be used to store the JSON format.

**What are the benefits of storing data in this way?** <br>
* No schema requirements
* Flexible storage

**What are the drawbacks?** <br>
* Difficult to access data
* Loosely organized

****

#### 4. As you build your relational database, what are three important components to consider? Describe each of these three components and why they are important.

* **Tables**: Entities that contain data in rows and columns. Tables are the building blocks of databases and are named after the entity they represent.
* **Constraints**: Used to control the relationships between tables and the type of data that can be inserted into a table to preserve data integrity.
* **Keys**: Used to specify the relationships between tables. The primary key is the unique identifier in a table. A foreign key is used to link a table to an other table's primary key.

****

#### 5. Using SQL code in Jupyter notebook, create a SQL database using SQLite in Jupyter notebook and create two tables. The first table should be called “orders” and have the following columns/fields: order ID, item name, price, and customer ID. The second table should be called “customers” and have the following columns/fields: customer ID, signup_year, country, and age.Designate which columns will be primary keys and whether there is a foreign key in one of the tables that links to a primary key in another table. Add SQL constraints to ensure that there are no null values in the signup_year column.

In [1]:
# Load SQL module
%load_ext sql

In [2]:
# Create to the SQLite database
%sql sqlite:///opan6608_assignment2.db

Connecting to 'sqlite:///opan6608_assignment2.db'

In [3]:
%%sql

--Create customers table
CREATE TABLE customers(
    customer_id INT PRIMARY KEY,
    signup_year INT NOT NULL,
    country VARCHAR(20),
    age INT);

Running query in 'sqlite:///opan6608_assignment2.db'

++
||
++
++

In [4]:
%%sql
    
--Create orders table
CREATE TABLE orders(
    order_id INT PRIMARY KEY,
    item_name VARCHAR(20),
    price DECIMAL(5, 2),
    customer_id INT,
    FOREIGN KEY(customer_id) REFERENCES customers(customer_id)
);

Running query in 'sqlite:///opan6608_assignment2.db'

++
||
++
++

****

#### 6. Provide a written description of the SQL code you wrote above in Q6 in a way that a non-technical person with no knowledge of SQL could read and understand. Explain why the columns you chose are primary and foreign keys and the importance of keys in relational databases to a colleague who has no knowledge of databases or SQL.

**Written Description of SQL Code**: <br>

"customers" table: 

* **customer_id**: This is a unique identifier for each customer.
* **signup_year**: This column records the year in which the customer signed up. This field cannot be empty.
* **country**: This column stores the country where the customer is located.
* **age**: This column records the customer's age.

"orders" table:
* **order_id**: This is a unique identifier for each order.
* **item_name**: This column stores the name of the item that was ordered.
* **price**: This column records the price of the item.
* **customer_id**: This column links each order to the customer who made the purchase.

**Explain why the columns you chose are primary and foreign keys and the importance of keys in relational databases.**<br>

Primary and Foreign Keys:
* **Primary Key**: A primary key is a unique identifier for each record in a table. This ensures that each entry in the table is unique and can be easily referenced. In the "customers" table created, `customer_id` is primary key because it uniquely identifies each customer. In the "orders" table, `order_id` is the primary key because it uqniquely identifies each order.
* **Foreign Key**: The foreign key is used to link table to other tables' primary key. In the "orders" table, `customer_id` is a foreign key that links to `customer_id` in the "orders" table. This link allows us to see the information of the customer who placed the order.

Keys are important in relational databases because they help organize data, establish relationships between tables, and ensuring data integrity.

****

#### 7. Insert the following data into the “orders” table.

In [5]:
%%sql

INSERT INTO orders(order_id, item_name, price, customer_id)
VALUES
(100, "Blender", 45.66, 1001),
(101, "Blender", 43.23, 1098),
(102, "Treadmill", 765.76, 1009),
(103, "TV", 954.33, 1045),
(104, "TV", 476.60, 1003),
(105, "Lamp", 26.76, 1008),
(106, "Laptop", 1300.34, 1098),
(107, "TV", 675.55, 1011),
(108, "Treadmill", 886.87, 1003),
(109, "Treadmill", 1987.54, 1055);

Running query in 'sqlite:///opan6608_assignment2.db'

10 rows affected.

++
||
++
++

****

#### 8. Insert the following data into the “customers” table.

In [6]:
%%sql

INSERT INTO customers(customer_id, signup_year, country, age)
VALUES
(1000, 2004, "USA", 63),
(1001, 2008, "FR", 44),
(1002, 2010, "UK", 76),
(1003, 2018, "FR", 28),
(1004, 2001, "FR", 71),
(1005, 2015, "USA", 25),
(1006, 2017, "USA", 58),
(1007, 2009, "USA", 51),
(1008, 2020, "UK", 48),
(1009, 2017, "USA", 42);

Running query in 'sqlite:///opan6608_assignment2.db'

10 rows affected.

++
||
++
++

****

#### 9. Write a query to pull all records and columns from the orders table.

In [7]:
%config SqlMagic.displaylimit = None

displaylimit: Value None will be treated as 0 (no limit)

In [8]:
%%sql 

SELECT *
FROM orders;

Running query in 'sqlite:///opan6608_assignment2.db'

+----------+-----------+---------+-------------+
| order_id | item_name |  price  | customer_id |
+----------+-----------+---------+-------------+
|   100    |  Blender  |  45.66  |     1001    |
|   101    |  Blender  |  43.23  |     1098    |
|   102    | Treadmill |  765.76 |     1009    |
|   103    |     TV    |  954.33 |     1045    |
|   104    |     TV    |  476.6  |     1003    |
|   105    |    Lamp   |  26.76  |     1008    |
|   106    |   Laptop  | 1300.34 |     1098    |
|   107    |     TV    |  675.55 |     1011    |
|   108    | Treadmill |  886.87 |     1003    |
|   109    | Treadmill | 1987.54 |     1055    |
+----------+-----------+---------+-------------+

****

#### 10. Write a query to pull all records and columns from the orders table but limit the output to the first four records.

In [9]:
%%sql

SELECT *
FROM orders
LIMIT 4;

Running query in 'sqlite:///opan6608_assignment2.db'

+----------+-----------+--------+-------------+
| order_id | item_name | price  | customer_id |
+----------+-----------+--------+-------------+
|   100    |  Blender  | 45.66  |     1001    |
|   101    |  Blender  | 43.23  |     1098    |
|   102    | Treadmill | 765.76 |     1009    |
|   103    |     TV    | 954.33 |     1045    |
+----------+-----------+--------+-------------+

****

#### 11. Write a query to select the sign up year, country, and age columns and only records of customers located in the UK from the customers table.

In [10]:
%%sql

SELECT
    signup_year,
    country,
    age
FROM customers
WHERE country = 'UK';

Running query in 'sqlite:///opan6608_assignment2.db'

+-------------+---------+-----+
| signup_year | country | age |
+-------------+---------+-----+
|     2010    |    UK   |  76 |
|     2020    |    UK   |  48 |
+-------------+---------+-----+

****

#### 12. What is the mean age of customers in the USA? Include the SQL code you used to get the answer.

In [11]:
%%sql

SELECT
    AVG(age) AS mean_age
FROM customers
WHERE country = 'USA';

Running query in 'sqlite:///opan6608_assignment2.db'

+----------+
| mean_age |
+----------+
|   47.8   |
+----------+

****

#### 13. Using the orders table, determine how many treadmills have been sold. Use an alias to rename the name of the result column to be “treadmills_sold.” Include the SQL code you used to get the answer.

In [12]:
%%sql

SELECT
    COUNT(*) as treadmills_sold
FROM orders
WHERE item_name = 'Treadmill';

Running query in 'sqlite:///opan6608_assignment2.db'

+-----------------+
| treadmills_sold |
+-----------------+
|        3        |
+-----------------+

****

#### 14. How old is the youngest customer in the USA?

In [13]:
%%sql

SELECT MIN(age) as min_age
FROM customers;

Running query in 'sqlite:///opan6608_assignment2.db'

+---------+
| min_age |
+---------+
|    25   |
+---------+

****

#### 15. What is the mean age of customers in each country? Include the SQL code you used to get the answer.

In [14]:
%%sql

SELECT 
    country,
    AVG(age) AS mean_age
FROM customers
GROUP BY country;

Running query in 'sqlite:///opan6608_assignment2.db'

+---------+--------------------+
| country |      mean_age      |
+---------+--------------------+
|    FR   | 47.666666666666664 |
|    UK   |        62.0        |
|   USA   |        47.8        |
+---------+--------------------+

****

#### 16. On average, what is the most expensive item purchased? Write a query to show the mean sale price of each item in the orders table and sort the results so the most expensive item is first and the least expensive item is last.

In [15]:
%%sql

SELECT
    item_name,
    AVG(price) AS avg_price
FROM orders
GROUP BY item_name
ORDER BY avg_price DESC;

Running query in 'sqlite:///opan6608_assignment2.db'

+-----------+-------------------+
| item_name |     avg_price     |
+-----------+-------------------+
|   Laptop  |      1300.34      |
| Treadmill |      1213.39      |
|     TV    |       702.16      |
|  Blender  | 44.44499999999999 |
|    Lamp   |       26.76       |
+-----------+-------------------+

****

#### 17. Alter the code you used for #17 to filter the results and keep only records that exceed 1000.00. Include the SQL code you used to get the answer.

In [16]:
%%sql

SELECT
    item_name,
    AVG(price) AS avg_price
FROM orders
GROUP BY item_name
HAVING avg_price > 1000
ORDER BY avg_price DESC;

Running query in 'sqlite:///opan6608_assignment2.db'

+-----------+-----------+
| item_name | avg_price |
+-----------+-----------+
|   Laptop  |  1300.34  |
| Treadmill |  1213.39  |
+-----------+-----------+

****

#### 18. Write a query to return the item names and price from the orders table that start with the “T” or cost less than 100.00

In [17]:
%%sql

SELECT
    item_name,
    price
FROM orders
WHERE
    item_name LIKE 'T%'
    OR price < 100;

Running query in 'sqlite:///opan6608_assignment2.db'

+-----------+---------+
| item_name |  price  |
+-----------+---------+
|  Blender  |  45.66  |
|  Blender  |  43.23  |
| Treadmill |  765.76 |
|     TV    |  954.33 |
|     TV    |  476.6  |
|    Lamp   |  26.76  |
|     TV    |  675.55 |
| Treadmill |  886.87 |
| Treadmill | 1987.54 |
+-----------+---------+

****

#### 19. What is the difference between WHERE and HAVING? Explain when to use one or the other.

* `WHERE`: To filter before grouping/aggregating. This is used when you need to filter rows based conditions before any aggregating or grouping is done.
* `HAVING`: To filter after grouping/aggregating. This is used when you need to filter groups based on aggregate conditions (e.g., SUM, AVG, COUNT).

****

#### 20. We need to know more about the customers who purchased the items in the orders table. Write a join to join the orders table to the customers table. The results should show only customers who have made a purchase that is listed in the orders table and are listed in the customers table and the item_name they purchased. (Note that not all customer ids are listed in the customer table.)

In [18]:
%%sql

SELECT 
    c.customer_id,
    c.signup_year,
    c.country,
    c.age,
    o.item_name
FROM orders AS o
INNER JOIN customers AS c
ON o.customer_id = c.customer_id;

Running query in 'sqlite:///opan6608_assignment2.db'

+-------------+-------------+---------+-----+-----------+
| customer_id | signup_year | country | age | item_name |
+-------------+-------------+---------+-----+-----------+
|     1001    |     2008    |    FR   |  44 |  Blender  |
|     1009    |     2017    |   USA   |  42 | Treadmill |
|     1003    |     2018    |    FR   |  28 |     TV    |
|     1008    |     2020    |    UK   |  48 |    Lamp   |
|     1003    |     2018    |    FR   |  28 | Treadmill |
+-------------+-------------+---------+-----+-----------+

****

#### 21. Alter the code you wrote in #21 to group the results by customer id from the customers table and count the number of orders for each customer made. Alias the result column as “num_orders” and sort the results so the customer with the most orders is the first row in the result. Which customer id has the most orders?

In [19]:
%%sql

SELECT 
    c.customer_id,
    c.signup_year,
    c.country,
    c.age,
    COUNT(o.order_id) AS num_orders
FROM orders AS o
INNER JOIN customers AS c
ON o.customer_id = c.customer_id
GROUP BY c.customer_id
ORDER BY num_orders DESC;

Running query in 'sqlite:///opan6608_assignment2.db'

+-------------+-------------+---------+-----+------------+
| customer_id | signup_year | country | age | num_orders |
+-------------+-------------+---------+-----+------------+
|     1003    |     2018    |    FR   |  28 |     2      |
|     1009    |     2017    |   USA   |  42 |     1      |
|     1008    |     2020    |    UK   |  48 |     1      |
|     1001    |     2008    |    FR   |  44 |     1      |
+-------------+-------------+---------+-----+------------+

****

#### 22. What kind of join would we use if we wanted to keep all records in the orders table (left table) and join any matches between the orders table and the customers table (right table)?

`LEFT JOIN`

****

#### 23. What is the average age of customers in the customers table? Include the SQL code you used to get the answer.

In [20]:
%%sql

SELECT
    AVG(age) AS 'Average Age'
FROM customers;

Running query in 'sqlite:///opan6608_assignment2.db'

+-------------+
| Average Age |
+-------------+
|     50.6    |
+-------------+

****

#### 24. Write a subquery (i.e. nested query) to filter the customers table to keep only records that are less than the average age for all customers in the table.

In [21]:
%%sql

SELECT *
FROM customers
WHERE age < (
    SELECT AVG(age)
    FROM customers);

Running query in 'sqlite:///opan6608_assignment2.db'

+-------------+-------------+---------+-----+
| customer_id | signup_year | country | age |
+-------------+-------------+---------+-----+
|     1001    |     2008    |    FR   |  44 |
|     1003    |     2018    |    FR   |  28 |
|     1005    |     2015    |   USA   |  25 |
|     1008    |     2020    |    UK   |  48 |
|     1009    |     2017    |   USA   |  42 |
+-------------+-------------+---------+-----+

****

#### 25. Return the country name and mean age for any countries' customers with a mean age greater than 60.

In [22]:
%%sql

SELECT 
    country,
    AVG(age) AS mean_age
FROM customers
GROUP BY country
HAVING mean_age > 60;

Running query in 'sqlite:///opan6608_assignment2.db'

+---------+----------+
| country | mean_age |
+---------+----------+
|    UK   |   62.0   |
+---------+----------+

****